<a href="https://colab.research.google.com/github/Abdelrhman410/DB/blob/main/SF-Salaries.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Case-study: Salaries EDA

Import Pandas as pd

In [1]:
import pandas as pd

Read Salaries.csv as dataframe

In [ ]:
df = pd.read_csv("https://raw.githubusercontent.com/Abdelrhman410/IMDB-Analysis/main/Salaries2.csv")

Check the head of the dataframe

In [3]:
df.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

Use the .info() method to find out how many entries there are

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148650 entries, 0 to 148649
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148650 non-null  int64
 1   EmployeeName      148650 non-null  object
 2   JobTitle          148650 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148650 non-null  float64
 8   TotalPayBenefits  148650 non-null  float64
 9   Year              148650 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148650 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(7), int64(2), object(4)
memory usage: 14.7+ MB

In [5]:
df.describe()

,Id,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes
count,148650.000000,148045.000000,148650.000000,148650.000000,112491.000000,148650.000000,148650.000000,148650.000000,0.0
mean,74325.500047,66325.448840,5066.059886,3648.767297,25007.893151,74770.333901,93695.075969,2012.522603,NaN
std,42911.703176,42764.635495,11454.380559,8056.601866,15402.215858,50516.196009,62792.497391,1.117526,NaN
min,1.000000,-166.010000,-0.010000,-7058.590000,-33.890000,-618.130000,-618.130000,2011.000000,NaN
25%,37163.250000,33588.200000,0.000000,0.000000,11535.395000,36169.955000,44073.337500,2012.000000,NaN
50%,74325.500000,65007.450000,0.000000,811.270000,28628.620000,71427.240000,92406.020000,2013.000000,NaN
75%,111487.750000,94691.050000,4658.175000,4236.065000,35566.855000,105842.960000,132877.992500,2014.000000,NaN
max,148654.000000,319275.010000,245131.880000,400184.250000,96570.660000,567595.430000,567595.430000,2014.000000,NaN

What is the avarge BasePay ?

In [6]:
df["BasePay"].mean()

66325.4488404877



---

What is the highest amount of OvertimePay in the dataset ?

In [7]:
df["OvertimePay"].max()

245131.88



---

What is the job title of JOSEPH DRISCOLL ? Note : Use all caps, otherwise you may get an answer that doesn't match up(there is also the lowercase Joseph Driscoll).

In [8]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["JobTitle"]

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object



---

How much does JOSEPH DRISCOLL make (including benefits) ?

In [9]:
df[df["EmployeeName"] == "JOSEPH DRISCOLL"]["TotalPayBenefits"]

24    270324.91
Name: TotalPayBenefits, dtype: float64



---

What is the name of highest paid person (including benefits) ?

In [10]:
df["TotalPayBenefits"].max()

567595.43

In [11]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].max()]["EmployeeName"]

0    NATHANIEL FORD
Name: EmployeeName, dtype: object



---

What is the name of lowest paid person (including benefits) ?

In [12]:
df[df["TotalPayBenefits"] == df["TotalPayBenefits"].min()]["EmployeeName"]

148649    Joe Lopez
Name: EmployeeName, dtype: object



---

What is the average BasePay of all employees per year (2011-2014) ?

In [15]:
df.groupby("Year").mean()["BasePay"]

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64



---

How many unique job titles are there ?

In [16]:
df["JobTitle"].nunique()

2158



---

What are the top 5 most popular jobs ?

In [19]:
#df["JobTitle"].value_counts().head(5)
df["JobTitle"].value_counts()[:5]

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64



---

How many Job Titles were represented by only one person in 2013 ?

In [27]:
(df[df["Year"] == 2013]["JobTitle"].value_counts() == 1).sum()

202



---

How many people have the word Chief in their job title ?

In [29]:
def chief(string):
  if "chief" in (string.lower()):
    return True
  else:
    return False

In [32]:
(df["JobTitle"].apply(lambda x: chief(x))).sum()

627



---

Is there a correlation between length of Job Title string and Salary ?

In [33]:
df["ntitles"] = df["JobTitle"].apply(len)
df["ntitles"]

0         46
1         31
2         31
3         36
4         44
          ..
148645    25
148646    27
148647     9
148648     9
148649    26
Name: ntitles, Length: 148650, dtype: int64

In [36]:
df[["ntitles", "TotalPayBenefits"]].corr()

                  ntitles  TotalPayBenefits
ntitles           1.00000          -0.03692
TotalPayBenefits -0.03692           1.00000

There is no correlation



---